RT-Thread/rt-thread/bsp/microchip/saml10/bsp/include/saml10e16a.h
/**
 * \file
 *
 * \brief Header file for ATSAML10E16A
 *
 * Copyright (c) 2019 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2019-01-31T14:29:25Z */
#ifndef _SAML10E16A_H_
#define _SAML10E16A_H_

/** \addtogroup SAML10E16A_definitions SAML10E16A definitions
  This file defines all structures and symbols for SAML10E16A:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

/** \defgroup Atmel_glob_defs Atmel Global Defines

    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.

    \remark
    CMSIS core has a syntax that differs from this using i.e. __I, __O, or __IO followed by 'uint<size>_t' respective types.
    Default the header files will follow the CMSIS core syntax.
 *  @{
 */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>

/* IO definitions (access restrictions to peripheral registers) */
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */

#define CAST(type, value) ((type *)(value)) /**< Pointer Type Conversion Macro for C/C++ */
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else /* Assembler */
#define CAST(type, value) (value) /**< Pointer Type Conversion Macro for Assembler */
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)

#if defined(_U_) || defined(_L_) || defined(_UL_)
  #error "Integer Literals macros already defined elsewhere"
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#define _U_(x) x ## U    /**< C code: Unsigned integer literal constant value */
#define _L_(x) x ## L    /**< C code: Long integer literal constant value */
#define _UL_(x) x ## UL  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#define _L_(x) x    /**< Assembler: Long integer literal constant value */
#define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/** \addtogroup SAML10E16A_cmsis CMSIS Definitions
 *  @{
 */
/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAML10E16A */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M23 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< 1   Reset Vector, invoked on Power up and warm reset  */
  NonMaskableInt_IRQn       = -14, /**< 2   Non maskable Interrupt, cannot be stopped or preempted  */
  HardFault_IRQn            = -13, /**< 3   Hard Fault, all classes of Fault     */
  SVCall_IRQn               = -5 , /**< 11  System Service Call via SVC instruction  */
  PendSV_IRQn               = -2 , /**< 14  Pendable request for system service  */
  SysTick_IRQn              = -1 , /**< 15  System Tick Timer                    */
/******  SAML10E16A specific Interrupt Numbers ***********************************/
  SYSTEM_IRQn               = 0  , /**< 0   SAML10E16A Main Clock (MCLK)        */
  WDT_IRQn                  = 1  , /**< 1   SAML10E16A Watchdog Timer (WDT)     */
  RTC_IRQn                  = 2  , /**< 2   SAML10E16A Real-Time Counter (RTC)  */
  EIC_0_IRQn                = 3  , /**< 3   SAML10E16A External Interrupt Controller (EIC) */
  EIC_1_IRQn                = 4  , /**< 4   SAML10E16A External Interrupt Controller (EIC) */
  EIC_2_IRQn                = 5  , /**< 5   SAML10E16A External Interrupt Controller (EIC) */
  EIC_3_IRQn                = 6  , /**< 6   SAML10E16A External Interrupt Controller (EIC) */
  EIC_OTHER_IRQn            = 7  , /**< 7   SAML10E16A External Interrupt Controller (EIC) */
  FREQM_IRQn                = 8  , /**< 8   SAML10E16A Frequency Meter (FREQM)  */
  NVMCTRL_IRQn              = 9  , /**< 9   SAML10E16A Non-Volatile Memory Controller (NVMCTRL) */
  PORT_IRQn                 = 10 , /**< 10  SAML10E16A Port Module (PORT)       */
  DMAC_0_IRQn               = 11 , /**< 11  SAML10E16A Direct Memory Access Controller (DMAC) */
  DMAC_1_IRQn               = 12 , /**< 12  SAML10E16A Direct Memory Access Controller (DMAC) */
  DMAC_2_IRQn               = 13 , /**< 13  SAML10E16A Direct Memory Access Controller (DMAC) */
  DMAC_3_IRQn               = 14 , /**< 14  SAML10E16A Direct Memory Access Controller (DMAC) */
  DMAC_OTHER_IRQn           = 15 , /**< 15  SAML10E16A Direct Memory Access Controller (DMAC) */
  EVSYS_0_IRQn              = 16 , /**< 16  SAML10E16A Event System Interface (EVSYS) */
  EVSYS_1_IRQn              = 17 , /**< 17  SAML10E16A Event System Interface (EVSYS) */
  EVSYS_2_IRQn              = 18 , /**< 18  SAML10E16A Event System Interface (EVSYS) */
  EVSYS_3_IRQn              = 19 , /**< 19  SAML10E16A Event System Interface (EVSYS) */
  EVSYS_NSCHK_IRQn          = 20 , /**< 20  SAML10E16A Event System Interface (EVSYS) */
  PAC_IRQn                  = 21 , /**< 21  SAML10E16A Peripheral Access Controller (PAC) */
  SERCOM0_0_IRQn            = 22 , /**< 22  SAML10E16A Serial Communication Interface (SERCOM0) */
  SERCOM0_1_IRQn            = 23 , /**< 23  SAML10E16A Serial Communication Interface (SERCOM0) */
  SERCOM0_2_IRQn            = 24 , /**< 24  SAML10E16A Serial Communication Interface (SERCOM0) */
  SERCOM0_OTHER_IRQn        = 25 , /**< 25  SAML10E16A Serial Communication Interface (SERCOM0) */
  SERCOM1_0_IRQn            = 26 , /**< 26  SAML10E16A Serial Communication Interface (SERCOM1) */
  SERCOM1_1_IRQn            = 27 , /**< 27  SAML10E16A Serial Communication Interface (SERCOM1) */
  SERCOM1_2_IRQn            = 28 , /**< 28  SAML10E16A Serial Communication Interface (SERCOM1) */
  SERCOM1_OTHER_IRQn        = 29 , /**< 29  SAML10E16A Serial Communication Interface (SERCOM1) */
  SERCOM2_0_IRQn            = 30 , /**< 30  SAML10E16A Serial Communication Interface (SERCOM2) */
  SERCOM2_1_IRQn            = 31 , /**< 31  SAML10E16A Serial Communication Interface (SERCOM2) */
  SERCOM2_2_IRQn            = 32 , /**< 32  SAML10E16A Serial Communication Interface (SERCOM2) */
  SERCOM2_OTHER_IRQn        = 33 , /**< 33  SAML10E16A Serial Communication Interface (SERCOM2) */
  TC0_IRQn                  = 34 , /**< 34  SAML10E16A Basic Timer Counter (TC0) */
  TC1_IRQn                  = 35 , /**< 35  SAML10E16A Basic Timer Counter (TC1) */
  TC2_IRQn                  = 36 , /**< 36  SAML10E16A Basic Timer Counter (TC2) */
  ADC_OTHER_IRQn            = 37 , /**< 37  SAML10E16A Analog Digital Converter (ADC) */
  ADC_RESRDY_IRQn           = 38 , /**< 38  SAML10E16A Analog Digital Converter (ADC) */
  AC_IRQn                   = 39 , /**< 39  SAML10E16A Analog Comparators (AC)  */
  DAC_UNDERRUN_A_IRQn       = 40 , /**< 40  SAML10E16A Digital Analog Converter (DAC) */
  DAC_EMPTY_IRQn            = 41 , /**< 41  SAML10E16A Digital Analog Converter (DAC) */
  PTC_IRQn                  = 42 , /**< 42  SAML10E16A Peripheral Touch Controller (PTC) */
  TRNG_IRQn                 = 43 , /**< 43  SAML10E16A True Random Generator (TRNG) */
  TRAM_IRQn                 = 44 , /**< 44  SAML10E16A TrustRAM (TRAM)          */

